CSI API ETABS v1

# cSapModelSetMergeTol Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetMergeTol(
    	double MergeTol
    )

    Function SetMergeTol (
    	MergeTol As Double
    ) As Integer

    Dim instance As cSapModel
    Dim MergeTol As Double
    Dim returnValue As Integer

    returnValue = instance.SetMergeTol(MergeTol)

    int SetMergeTol(
    	double MergeTol
    )

    abstract SetMergeTol :
            MergeTol : float -> int

#### Parameters

MergeTol

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com